{
    "process": "If you need to update the name on your permanent resident card, you must apply for a new card (reissued cards are not available for name changes). Complete the [PR Card Application (IMM-5445)](https://www.canada.ca/en/immigration-refugees-citizenship/services/application/application-forms-guides/guide-5445-applying-permanent-resident-card-card-first-application-replacement-renewal-change-gender-identifier) to start the process. The fee is $50.",
    "requirements": "Use the [Permanent Resident Card Document Checklist (IMM-5644)](/downloads#pr) to confirm which documents you need. Include the completed checklist with your application, along with the following:\n\n- Copy of the receipt showing the fees paid\n- Photos, meeting the [photo specifications (PDF)](https://www.canada.ca/content/dam/ircc/migration/ircc/english/pdf/photospecs-e.pdf)\n  - If applying online: upload 1 photo (front and back) taken within 12 months. For digital photos, upload a confirmation from the photo studio if required\n  - If applying by paper: provide two (2) identical photos taken within 12 months, in a small envelope with the applicant's name written on it (no staples or paper clips)\n- Documents showing you meet the residency obligation for the past 5 years\n- A copy of one of the following:\n  - Your valid passport or travel document\n  - The passport or travel document you had when you became a permanent resident (include the page stamped on arrival, if applicable)\n  - Certificate of identity or travel document issued by IRCC or a foreign country\n  *(The copy should show document type and number, issue and expiry date, your name, photo, and date of birth.)*\n- [Change of name certificate](/name)\n- Your current PR card (if renewing or replacing)\n\n> If your PR card was lost, include a copy of a police report or incident number.",
    "inExceptionalCases": "If you cannot obtain a primary identity document, provide:\n\n- A copy of any identity document issued outside Canada before you came to Canada, or\n- A statutory declaration signed by you attesting to your identity and a statutory declaration also attesting to your identity signed by:\n  - a person who knew you before you came to Canada (such as a family member), or\n  - an official of an organization representing people from your country of nationality or past residence.\n\n>All statutory declarations must be certified by an accredited commissioner of oaths. If submitting a statutory declaration, also provide a letter explaining the exceptional circumstances and why you cannot obtain identity documents.",
    "translations": "Any document not in English or French must be accompanied by:\n\n- The English or French translation\n- An affidavit from the translator (if not a Canadian certified translator)\n\nTranslations must not be done by the applicant or their family members.",
    "importantConsiderations": "- Temporary Residence Permits cannot be amended to reflect changes made in Canada (e.g., a name change completed in Ontario). Your temporary residence permit must match your passport.\n- If your name change document was issued outside of Canada, you must also provide a provincial ID in your new name (such as [a driver's license, photo card](/id), or [health card](/health))."
}