{
    "process": "When updating the sex designation on your Ontario driver's license or photo card, you can choose F, M, or X. The process depends on which designation you select.\n\nUpdating your driver's license is free if you already have one. If you don't drive, you can get an Ontario photo card for $35.\n\nWe highly recommend the photo card for trans and non-binary people who don't have a driver's license. It's a helpful piece of I.D. for proving your legal name, sex designation, and address, and can make other document changes, voting, and bureaucratic processes easier.",
    "to-x": "To change your sex designation to X (gender neutral), just visit a ServiceOntario location. No supporting documents are required.",
    "to-f-or-m": "For binary sex designation changes (M to F or F to M), go to ServiceOntario and bring the following original documents (photocopies are not accepted):\n\n- Your current driver's license or photo ID\n- Original copy of change of name certificate _(if you are changing your name)_\n- Original, valid long or short form birth certificate _(showing the correct information)_ or a certified copy of your birth registration\n\nIf you don't have a birth certificate or registration with the correct gender marker, bring these two documents instead:\n\n1. A letter from a licensed doctor or psychologist (on their letterhead) stating they have examined or treated you and that the updated designation is appropriate. The letter must be signed by the doctor and should specify that you wish to update your driver's license.\n2. A letter from you that includes:\n   - The change you want to make\n   - Your full name\n   - Your current address\n   - Your driver's license or photo card number\n   - The name and address of the doctor or psychologist who signed the supporting letter\n\nMake sure you have original copies of these documents, signed in ink. ServiceOntario does not accept e-signatures or photocopies.\n\nYou do not need to have undergone surgery in order to update your gender marker. However, if you have had surgery, you can present documentation from a recognized specialist (such as the Centre for Addiction and Mental Health or other comparable institutions) instead of a letter from a doctor or psychologist.",
    "importantConsiderations": "By law in Ontario, if you have a driver's license, you must notify the Ministry of Transportation within 6 days of [legally changing your name](/on/name). Be sure to include this step when updating your documents."
}