{
    "process": "To legally change your name in Ontario, you must complete the [Ontario application to change an adult's name](/downloads#on-name). The fee is $137.00.",
    "birthCertificateDetails": "If your name change is approved and you were born in Ontario, you will automatically receive a new birth certificate in your new name.\n\n> Note: The default birth certificate issued does not include parental information. If you want a birth certificate with parental information or a certified copy of your birth registration, you must apply separately and pay the required fee.",
    "informationYoullNeedToProvide": "The application asks for detailed personal information, including:\n\n1. Full current legal name\n2. New chosen name\n3. Mailing address and contact information\n4. Date and location of birth\n5. Marital/relationship status\n6. Parental information\n7. Details of any previous name change\n8. Information about any current or past criminal offences\n9. Information about any current or past financial judgments, fines, or bankruptcy\n\nYou must also provide supporting documents, such as your birth certificate (original or certified copy), and translations if not in English or French.",
    "extraSectionsAndDocuments": "- If you are married or in a conjugal relationship, you must notify your partner or spouse and complete Part 2.\n- If you are 16 or 17, you need consent from everyone with legal custody and must complete Part 3.\n- If you have any law enforcement orders, criminal convictions, or pending charges, you'll need a police record check. Download the [Requirements for a Police Record Check for a Change of Name form (5349e)](/downloads#on-name) to ensure the check meets all requirements.\n- If you were born elsewhere in Canada and want a new birth certificate, contact the province or territory where you were born after you get your change of name certificate.",
    "guarantorStatement": "You'll need a guarantor who can confirm you've lived in Ontario for the past 12 months. Most people use a medical professional, but other options include provincial judges, justices of the peace, chiefs of Indian bands, marriage officiants, medical practitioners, lawyers, municipal heads/clerks, school principals, and bank managers/signing officers. If you can't find someone who meets the requirements, you can use a non-relative who has known you for at least five years and can confirm your Ontario residency. Have your guarantor complete and sign the statement before you submit your application.",
    "previousIdentityDocuments": "- If you were born in Ontario and have a valid birth certificate, include the originals (or certified copies) of all previously issued short- or long-form certificates.\n- If you were born elsewhere in Canada, submit either an original birth certificate or a certified copy from your province or territory of birth.\n- If you don't have a birth certificate, you'll likely need to apply for one before submitting your name change application.\n- If any supporting documents are not in English or French, you must provide a translation. \n\n>Translation requirements: Include a complete photocopy of the original document, a complete photocopy of the translation, and an original written declaration from the translator. The translator must state they understand both languages and that the translation is complete and correct. If the translator is not a professional, the declaration must be sworn before a commissioner for taking affidavits. If the declaration appears on the translation, submit the original translation (not a photocopy).",
    "requestForNonPublication": "By default, all name changes in Ontario are published in The Ontario Gazette (online only). If you are transgender, First Nations, Inuit, or Métis, you can request non-publication by submitting a [Request for Non-Publication form (11320e)](/downloads#on-name) with your application. If you do not want your previous name published, we strongly recommend including this form. Fill out the request and submit it with your application.",
    "indigenousApplicantsAndSingleNameChanges": "If you are First Nations, Inuit, or Métis, you may be eligible to have ServiceOntario fees waived when reclaiming a traditional Indigenous name or changing to a single name as part of your culture. You can also request non-publication of your name change in The Ontario Gazette. For more information and forms, see the ServiceOntario website or contact ServiceOntario directly.\n\nYou can apply to change your name (or your child's name) to a single name if it is part of your or your child's traditional culture. Indigenous applicants may also reclaim a traditional name at no cost. You must submit the Request for a Name Change with a Single Name form along with your application. Follow all instructions on the forms and provide any required supporting documents.",
    "refugeesAndPermanentResidents": "You must be a legal resident to change your name in Ontario. It's easiest to do this when you apply for permanent residency, so your new name appears on your Permanent Resident card. If you change your name later, you'll need to [update your PR card](/pr).",
    "commissioning": "You must sign the statutory declaration (page 16) in front of a commissioner for taking affidavits, who will stamp or seal the document to verify your identity and the accuracy of your information. The commissioner does not need to know you personally. Many notary/commissioner offices in Ontario will commission these documents for trans individuals for free; otherwise, the typical fee is $30-45. If submitting in person, ServiceOntario can commission for free.\n\n> For trans I.D. clinics and commissioning services, see [Ontario resources](/on/resources) for a list of local and province-wide organizations.",
    "importantConsiderations": "Give yourself plenty of time to gather information and complete the forms. It may take several weeks to get everything ready.\n\nPrint clearly with blue or black ink. Don't use correction fluid. If you make a mistake or need to change information:\n\n- Put brackets around the incorrect info\n- Write the correct info\n- Initial each change\n- Have the commissioner initial each change before it's sworn\n\nYour change of name certificate will show both your previous and new names. Use this certificate to update other documents, like your [driver's license, photo card](/on/id), or [health card](/on/health). By law, you must notify the Ministry of Transportation within 6 days of legally changing your name if you have a driver's license.\n\nIf you want to update your gender marker and were born in Ontario, you can submit the [Application for Change of Sex Designation on a Birth Registration of an Adult (11325e)](/downloads#on-birth) along with your name change application. For details, see the [birth certificates guide](/on/birth).",
    "byMail-1": "Mail your completed form, payment, and required documents to:",
    "byMail-2": "Tip: Use a registered or tracked mail service to avoid lost applications.\n\nTo contact the Office of the Registrar General for more information or to get forms:\n\n- 1-800-461-2156 (outside Toronto but within North America)\n- 416-325-8305 (in Toronto or outside North America)\n- TTY/Teletypewriter (for the hearing impaired): 416-325-3408\n",
    "inPerson": "If you prefer to submit in person and are in Toronto, bring your completed form, payment, and documents to:",
    "deliveryTime": "As of 2026, change of name applications are taking 18-24 weeks to process. It also may take longer for single name or reclaimed name changes. If you were born in Ontario, you'll also get your updated birth certificate. If you were born elsewhere in Canada, notice of your name change is sent to the vital statistics office in your province or territory, and you'll likely need to apply there for a new birth certificate. Contact ServiceOntario if you have not received your certificate after 24 weeks."
}